ycsb/logs/RDMA_BP_4_async_th_28/workloada.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 16517882, 0.000000
[OVERALL], RunTime(ms), 4230
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 23640.66193853428
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 40.8549
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 2141
[READ], 95thPercentileLatency(us), 56
[READ], 99thPercentileLatency(us), 66
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5702.0
[CLEANUP], MinLatency(us), 5700
[CLEANUP], MaxLatency(us), 5703
[CLEANUP], 95thPercentileLatency(us), 5703
[CLEANUP], 99thPercentileLatency(us), 5703
total zerocopy send size = 0, total send size = 16513894, 0.000000
total zerocopy send size = 0, total send size = 16515839, 0.000000
[OVERALL], RunTime(ms), 4310
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 23201.85614849188
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 41.70302
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 2213
[READ], 95thPercentileLatency(us), 58
[READ], 99thPercentileLatency(us), 68
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3763.0
[CLEANUP], MinLatency(us), 3762
[CLEANUP], MaxLatency(us), 3763
[CLEANUP], 95thPercentileLatency(us), 3763
[CLEANUP], 99thPercentileLatency(us), 3763
[OVERALL], RunTime(ms), 4331
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 23089.355806972984
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 41.81492
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 2281
[READ], 95thPercentileLatency(us), 58
[READ], 99thPercentileLatency(us), 68
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5486.0
[CLEANUP], MinLatency(us), 5484
[CLEANUP], MaxLatency(us), 5487
[CLEANUP], 95thPercentileLatency(us), 5487
[CLEANUP], 99thPercentileLatency(us), 5487
total zerocopy send size = 0, total send size = 16513685, 0.000000
[OVERALL], RunTime(ms), 4688
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 21331.058020477816
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 45.42822
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 3683
[READ], 95thPercentileLatency(us), 65
[READ], 99thPercentileLatency(us), 79
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 7402.0
[CLEANUP], MinLatency(us), 7400
[CLEANUP], MaxLatency(us), 7403
[CLEANUP], 95thPercentileLatency(us), 7403
[CLEANUP], 99thPercentileLatency(us), 7403