ycsb/logs/RDMA_BP_4_async_th_28/workloadc.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 16530984, 0.000000
[OVERALL], RunTime(ms), 3679
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 27181.29926610492
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 35.27996
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 2693
[READ], 95thPercentileLatency(us), 47
[READ], 99thPercentileLatency(us), 55
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5082.0
[CLEANUP], MinLatency(us), 5080
[CLEANUP], MaxLatency(us), 5083
[CLEANUP], 95thPercentileLatency(us), 5083
[CLEANUP], 99thPercentileLatency(us), 5083
total zerocopy send size = 0, total send size = 16522469, 0.000000
[OVERALL], RunTime(ms), 3669
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 27255.382938130282
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 35.30926
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 2733
[READ], 95thPercentileLatency(us), 47
[READ], 99thPercentileLatency(us), 54
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3749.0
[CLEANUP], MinLatency(us), 3748
[CLEANUP], MaxLatency(us), 3749
[CLEANUP], 95thPercentileLatency(us), 3749
[CLEANUP], 99thPercentileLatency(us), 3749
total zerocopy send size = 0, total send size = 16530947, 0.000000
[OVERALL], RunTime(ms), 3775
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 26490.066225165563
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 36.32164
[READ], MinLatency(us), 23
[READ], MaxLatency(us), 2677
[READ], 95thPercentileLatency(us), 48
[READ], 99thPercentileLatency(us), 56
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 3455.0
[CLEANUP], MinLatency(us), 3454
[CLEANUP], MaxLatency(us), 3455
[CLEANUP], 95thPercentileLatency(us), 3455
[CLEANUP], 99thPercentileLatency(us), 3455
total zerocopy send size = 0, total send size = 16517155, 0.000000
[OVERALL], RunTime(ms), 3737
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 26759.43270002676
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 100000
[READ], AverageLatency(us), 35.92679
[READ], MinLatency(us), 21
[READ], MaxLatency(us), 2613
[READ], 95thPercentileLatency(us), 48
[READ], 99thPercentileLatency(us), 57
[READ], Return=OK, 100000
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2237.0
[CLEANUP], MinLatency(us), 2236
[CLEANUP], MaxLatency(us), 2237
[CLEANUP], 95thPercentileLatency(us), 2237
[CLEANUP], 99thPercentileLatency(us), 2237