ycsb/logs/RDMA_BP_4_async_th_28/workloadf.log
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
Select RDMA Busy Polling mode
[...]
total zerocopy send size = 0, total send size = 84790595, 0.000000
[OVERALL], RunTime(ms), 9396
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 10642.826734780758
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 28
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.29799914857386123
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 28
[TOTAL_GC_TIME_%], Time(%), 0.29799914857386123
[READ], Operations, 100000
[READ], AverageLatency(us), 46.44037
[READ], MinLatency(us), 25
[READ], MaxLatency(us), 8035
[READ], 95thPercentileLatency(us), 66
[READ], 99thPercentileLatency(us), 83
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50370
[READ-MODIFY-WRITE], AverageLatency(us), 137.58737343656938
[READ-MODIFY-WRITE], MinLatency(us), 84
[READ-MODIFY-WRITE], MaxLatency(us), 30223
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 180
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 227
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5570.0
[CLEANUP], MinLatency(us), 5568
[CLEANUP], MaxLatency(us), 5571
[CLEANUP], 95thPercentileLatency(us), 5571
[CLEANUP], 99thPercentileLatency(us), 5571
[UPDATE], Operations, 50370
[UPDATE], AverageLatency(us), 89.9436370855668
[UPDATE], MinLatency(us), 53
[UPDATE], MaxLatency(us), 28847
[UPDATE], 95thPercentileLatency(us), 122
[UPDATE], 99thPercentileLatency(us), 157
[UPDATE], Return=OK, 50370
total zerocopy send size = 0, total send size = 84444053, 0.000000
[OVERALL], RunTime(ms), 9434
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 10599.957600169599
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 15
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.15899936400254397
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 15
[TOTAL_GC_TIME_%], Time(%), 0.15899936400254397
[READ], Operations, 100000
[READ], AverageLatency(us), 48.03641
[READ], MinLatency(us), 24
[READ], MaxLatency(us), 208383
[READ], 95thPercentileLatency(us), 65
[READ], 99thPercentileLatency(us), 82
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 50119
[READ-MODIFY-WRITE], AverageLatency(us), 139.33352620762585
[READ-MODIFY-WRITE], MinLatency(us), 81
[READ-MODIFY-WRITE], MaxLatency(us), 210303
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 178
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 225
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4870.0
[CLEANUP], MinLatency(us), 4868
[CLEANUP], MaxLatency(us), 4871
[CLEANUP], 95thPercentileLatency(us), 4871
[CLEANUP], 99thPercentileLatency(us), 4871
[UPDATE], Operations, 50119
[UPDATE], AverageLatency(us), 88.21295317145194
[UPDATE], MinLatency(us), 52
[UPDATE], MaxLatency(us), 8503
[UPDATE], 95thPercentileLatency(us), 121
[UPDATE], 99thPercentileLatency(us), 155
[UPDATE], Return=OK, 50119
total zerocopy send size = 0, total send size = 84164261, 0.000000
[OVERALL], RunTime(ms), 9696
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 10313.531353135313
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 12
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.12376237623762376
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 12
[TOTAL_GC_TIME_%], Time(%), 0.12376237623762376
[READ], Operations, 100000
[READ], AverageLatency(us), 48.83788
[READ], MinLatency(us), 22
[READ], MaxLatency(us), 8311
[READ], 95thPercentileLatency(us), 73
[READ], 99thPercentileLatency(us), 99
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49911
[READ-MODIFY-WRITE], AverageLatency(us), 142.16671675582538
[READ-MODIFY-WRITE], MinLatency(us), 81
[READ-MODIFY-WRITE], MaxLatency(us), 13959
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 193
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 277
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5254.0
[CLEANUP], MinLatency(us), 5252
[CLEANUP], MaxLatency(us), 5255
[CLEANUP], 95thPercentileLatency(us), 5255
[CLEANUP], 99thPercentileLatency(us), 5255
[UPDATE], Operations, 49911
[UPDATE], AverageLatency(us), 92.17457073590992
[UPDATE], MinLatency(us), 52
[UPDATE], MaxLatency(us), 13191
[UPDATE], 95thPercentileLatency(us), 127
[UPDATE], 99thPercentileLatency(us), 182
[UPDATE], Return=OK, 49911
total zerocopy send size = 0, total send size = 84229148, 0.000000
[OVERALL], RunTime(ms), 10262
[OVERALL], OP, 100000
[OVERALL], Throughput(ops/sec), 9744.689144416294
[TOTAL_GCS_PS_Scavenge], Count, 1
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 21
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.20463847203274216
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 21
[TOTAL_GC_TIME_%], Time(%), 0.20463847203274216
[READ], Operations, 100000
[READ], AverageLatency(us), 53.25228
[READ], MinLatency(us), 21
[READ], MaxLatency(us), 261247
[READ], 95thPercentileLatency(us), 76
[READ], 99thPercentileLatency(us), 100
[READ], Return=OK, 100000
[READ-MODIFY-WRITE], Operations, 49970
[READ-MODIFY-WRITE], AverageLatency(us), 146.2694616770062
[READ-MODIFY-WRITE], MinLatency(us), 69
[READ-MODIFY-WRITE], MaxLatency(us), 22927
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 200
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 269
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2583.0
[CLEANUP], MinLatency(us), 2582
[CLEANUP], MaxLatency(us), 2583
[CLEANUP], 95thPercentileLatency(us), 2583
[CLEANUP], 99thPercentileLatency(us), 2583
[UPDATE], Operations, 49970
[UPDATE], AverageLatency(us), 94.46419851911146
[UPDATE], MinLatency(us), 46
[UPDATE], MaxLatency(us), 22367
[UPDATE], 95thPercentileLatency(us), 131
[UPDATE], 99thPercentileLatency(us), 177
[UPDATE], Return=OK, 49970